 # Rozwiązanie zadań
W notatniku tym rozwiązane zostaną zlecone zadania, w oparciu o stworzoną bazę SQL.

## Połączenie z bazą danych

##### Importujemy potrzebne biblioteki oraz plik z ukrytymi danymi do logowania

In [37]:
import psycopg2
from dotenv import load_dotenv
import os
from sqlalchemy import create_engine
from sqlalchemy import text
import pandas as pd

In [16]:
# Ładujemy zmienne środowiskowe z pliku .env
load_dotenv('DB_pass.env')

True

##### Podłączamy się do bazy danych

In [19]:
# Tworzymy url połączenia
url = f"postgresql://{os.getenv('DB_USER')}:{os.getenv('DB_PASSWORD')}@{os.getenv('DB_HOST')}:{os.getenv('DB_PORT')}/{os.getenv('N_DB_NAME')}"

# Tworzymy engine dla sqlalchemy
engine = create_engine(url)

# Zadanie 1

Wybierz z tabeli `test_baza1` **NUMBERY** z `END_DT` większą od dziś oraz mniejszą niż 90 dni od dziś, oraz z segmentem **small** i **soho**.  
Do tych danych dopisz rekomendacje ofertowe (`PLAN`) z tabeli `test_baza2`.  
Jeżeli w drugiej tabeli nie ma rekomendacji, to przypisz **S** dla **soho** oraz **M** dla **small**.  
Wyniki zapisz do tabeli **tmp**.

In [32]:
# Wczytujemy kod SQL z pliku
with open('../sql/zadanie01.sql', 'r') as file:
    sql_query = file.read()

# Wykonanie zapytania z pliku SQL
with engine.begin() as connection:
    connection.execute(text(sql_query))

In [41]:
# Zapytanie SQL, aby sprawdzić 5 pierwszych wierszy z tabeli 'tmp'
query = "SELECT * FROM tmp LIMIT 5;"

# Wczytanie danych do Pandas za pomocą read_sql
with engine.connect() as connection:
    df_zadanie01 = pd.read_sql(query, connection)

df_zadanie01.head()

      number plan
0  506785018    X
1  528945862    M
2  572701364    M
3  504584766    M
4  586516824    M

# Zadanie 2

Podsumuj wyniki z tabeli `tmp` - liczba rekomendacji per `PLAN`.  
Wyniki posortuj po rekomendacji zgodnie z kolejnością **S**, **M**, **L**, **X**

In [58]:
# Wczytujemy kod SQL z pliku
with open('../sql/zadanie02.sql', 'r') as file:
    sql_query = file.read()

# Wykonanie zapytania z pliku SQL
with engine.begin() as connection:
    connection.execute(text(sql_query))

In [60]:
# Zapytanie SQL, aby przedstawić wynik zadania
query = "SELECT * FROM plan_recommendations;"

# Wczytanie danych do Pandas za pomocą read_sql
with engine.connect() as connection:
    df_zadanie02 = pd.read_sql(query, connection)

df_zadanie02

  plan  no_of_recommendations
0    S                    184
1    M                    504
2    L                    114
3    X                    153

# Zadanie 3

Utwórz rekomendację per ID. Dla każdego ID z tabeli `test_baza2` wybierz taką rekomendację, 
która na danym ID występuje najczęściej.

 W przypadku dopasowania kilku rekomendacji o tej samej 
liczności - wybierz wyższą (**S < M < L < X**). Przykładowo, jeśli dla **ID = 1** mamy dwie rekomendacje **M**, dwie rekomendacje **S** oraz jedną rekomendację **X** - wybierz **M**.

In [74]:
# Wczytujemy kod SQL z pliku
with open('../sql/zadanie03.sql', 'r') as file:
    sql_query = file.read()

# Wykonanie zapytania z pliku SQL
with engine.begin() as connection:
    connection.execute(text(sql_query))

In [76]:
# Zapytanie SQL, aby przedstawić wynik zadania
query = "SELECT * FROM recommended_plan;"

# Wczytanie danych do Pandas za pomocą read_sql
with engine.connect() as connection:
    df_zadanie03 = pd.read_sql(query, connection)

df_zadanie03.head(10)

         id recommended_plan
0  10001232                M
1  10002674                M
2  10006750                M
3  10008093                M
4  10010349                M
5  10014910                L
6  10015383                M
7  10016352                M
8  10019309                M
9  10022369                S

# Zadanie 4

Dla każdego `id` wypisz listę rekomendacji w nowej kolumnie w formacie: "plan: number, number, plan: number, number"

np. M: 577290614, 581909797, 593369145, S: 512000217, 524579635, 546508046, 577773401, X: 553705869.

In [95]:
# Wczytujemy kod SQL z pliku
with open('../sql/zadanie04.sql', 'r') as file:
    sql_query = file.read()

# Wykonanie zapytania z pliku SQL
with engine.begin() as connection:
    connection.execute(text(sql_query))

In [97]:
# Zapytanie SQL, aby przedstawić wynik zadania
query = "SELECT * FROM recommendation_list_per_id;"

# Wczytanie danych do Pandas za pomocą read_sql
with engine.connect() as connection:
    df_zadanie04 = pd.read_sql(query, connection)

df_zadanie04.head(15)

          id                        recommendations
0   10001232  S: 548448707, M: 591067693, 523586652
1   10002674                M: 518170097, 550293089
2   10006750                M: 553998152, 582220904
3   10008093                           M: 525856058
4   10010349     M: 501111806, 564232631, 553825128
5   10014910                           L: 557788700
6   10015383                M: 585230923, 544192241
7   10016352                           M: 524321330
8   10019309                           M: 546984948
9   10022369             S: 552276126, X: 534359690
10  10022836                           S: 570992866
11  10028166                           L: 544507219
12  10032400                L: 512740400, 521547261
13  10033686  M: 589895553, 544469379, L: 525170631
14  10041244                           X: 538262715